const TEXT = {
  hero: {
    h1: 'Пронајдете ги најдобрите цени на додатоци во исхраната во локалните аптеки.',
    p: 'Споредете ги понудите веднаш и заштедете на она што ви е потребно.',
  },
  form: {
    placeholder: 'Пример. Vitamin C',
    tryAISearch: 'Не најдовте тоа што ви треба? Обидете се со паметното пребарување!',
    noProductsFoundError: 'Не беа пронајдени продукти со вашето пребарување.',
    unexpectedError: 'Се случи неочекувана грешка.',
    loading: 'Се вчитува ...',
  },
  productsOnDiscount: {
    h1: 'Суплементи на попуст',
    noProductsOnDiscount: 'Денес нема суплементи на попуст. Проверете пак утре.',
    loading: 'Се вчитува ...',
    unexpectedError: 'Се случи неочекувана грешка.',
  },
  supportedPharmacies: {
    h1: 'Поддржани аптеки',
    loading: 'Се вчитува ...',
    unexpectedError: 'Се случи неочекувана грешка.',
  },
};

export default TEXT;
