const TEXT = {
  hero: {
    h1: 'Опишете ја вашата цел, а паметниот асистент ќе ги пронајде најдобрите суплементи за вас.',
  },
  form: {
    placeholder: 'Опишете ја вашата цел ... (на пр., подобрување на сонот)',
    unexpectedError: 'Се случи неочекувана грешка.',
    loading: 'Се вчитува ...',
  },
  searchResultsModal: {
    productsFound: (query: string, productsLength: number) =>
      `Паметниот асистент пронајде ${productsLength} суплементи за вашето барање: "${query}".`,
    noProductsFound: (query: string) =>
      `Паметниот асистент не пронајде суплементи за вашето барање "${query}". Обидете се повторно.`,

    errors: {
      client_error: 'Суплементот веќе е додаден во листата',
      unexpectedError: 'Се случи неочекувана грешка',
    },
  },
  myListsModal: {
    add: 'Додај го ',
    toMyList: 'во листа',
    noMyListsYet: 'Немате креирано листи',
    createMyList: 'Креирајте нова листа',
    create: 'Зачувај',
    cancel: 'Откажи',
    myListPlaceholder: 'Моја листа ...',

    errors: {
      client_error: 'Суплементот веќе е додаден во листата',
      unexpectedError: 'Се случи неочекувана грешка',
      myListNameAlreadyUsed: 'Веќе имате креирано листа со внесеното име.',
    },
  },
  warning: {
    h1: 'Оваа функционалност е само за информативни цели и не дијагностицира ниту лекува медицински состојби. Секогаш консултирајте се со здравствен работник пред да започнете со употреба на каков било суплемент.',
  },
};

export default TEXT;
