const TEXT = {
  hero: {
    h1: 'Опишете ја вашата цел, а нашата вештачка интелигенција ќе ги пронајде најдобрите суплементи за вас.',
  },
  form: {
    placeholder: 'Опишете ја вашата цел ... (на пр., подобрување на сонот)',
    noProductsFoundError: 'Не беа пронајдени продукти со вашето пребарување.',
    unexpectedError: 'Се случи неочекувана грешка.',
    loading: 'Се вчитува ...',
  },
  modal: {
    productsFound: (query: string, productsLength: number) =>
      `ВИ пронајде ${productsLength} суплементи за вашето барање: "${query}".`,
    noProductsFound: (query: string) =>
      `ВИ не пронајде суплементи за вашето барање "${query}". Обидете се повторно.`,
  },
  warning: {
    h1: 'Оваа функционалност е само за информативни цели и не дијагностицира ниту лекува медицински состојби. Секогаш консултирајте се со здравствен работник пред да започнете со употреба на каков било нов додаток во исхраната.',
  },
};

export default TEXT;
